MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K42/mcu.h
extern volatile INLVLEbits_t INLVLEbits __at(0x3A84);
// bitfield macros
#define _INLVLE_INLVLE0_POSN                                0x0
#define _INLVLE_INLVLE0_POSITION                            0x0
#define _INLVLE_INLVLE0_SIZE                                0x1
#define _INLVLE_INLVLE0_LENGTH                              0x1
#define _INLVLE_INLVLE0_MASK                                0x1
#define _INLVLE_INLVLE1_POSN                                0x1
#define _INLVLE_INLVLE1_POSITION                            0x1
#define _INLVLE_INLVLE1_SIZE                                0x1
#define _INLVLE_INLVLE1_LENGTH                              0x1
#define _INLVLE_INLVLE1_MASK                                0x2
#define _INLVLE_INLVLE2_POSN                                0x2
#define _INLVLE_INLVLE2_POSITION                            0x2
#define _INLVLE_INLVLE2_SIZE                                0x1
#define _INLVLE_INLVLE2_LENGTH                              0x1
#define _INLVLE_INLVLE2_MASK                                0x4
#define _INLVLE_INLVLE3_POSN                                0x3
#define _INLVLE_INLVLE3_POSITION                            0x3
#define _INLVLE_INLVLE3_SIZE                                0x1
#define _INLVLE_INLVLE3_LENGTH                              0x1
#define _INLVLE_INLVLE3_MASK                                0x8

// Register: IOCEP
#define IOCEP IOCEP
extern volatile unsigned char           IOCEP               __at(0x3A85);
#ifndef _LIB_BUILD
asm("IOCEP equ 03A85h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEP3                 :1;
    };
} IOCEPbits_t;
extern volatile IOCEPbits_t IOCEPbits __at(0x3A85);
// bitfield macros
#define _IOCEP_IOCEP3_POSN                                  0x3
#define _IOCEP_IOCEP3_POSITION                              0x3
#define _IOCEP_IOCEP3_SIZE                                  0x1
#define _IOCEP_IOCEP3_LENGTH                                0x1
#define _IOCEP_IOCEP3_MASK                                  0x8

// Register: IOCEN
#define IOCEN IOCEN
extern volatile unsigned char           IOCEN               __at(0x3A86);
#ifndef _LIB_BUILD
asm("IOCEN equ 03A86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEN3                 :1;
    };
} IOCENbits_t;
extern volatile IOCENbits_t IOCENbits __at(0x3A86);
// bitfield macros
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8

// Register: IOCEF
#define IOCEF IOCEF
extern volatile unsigned char           IOCEF               __at(0x3A87);
#ifndef _LIB_BUILD
asm("IOCEF equ 03A87h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEF3                 :1;
    };
} IOCEFbits_t;
extern volatile IOCEFbits_t IOCEFbits __at(0x3A87);
// bitfield macros
#define _IOCEF_IOCEF3_POSN                                  0x3
#define _IOCEF_IOCEF3_POSITION                              0x3
#define _IOCEF_IOCEF3_SIZE                                  0x1
#define _IOCEF_IOCEF3_LENGTH                                0x1
#define _IOCEF_IOCEF3_MASK                                  0x8

// Register: CCDPE
#define CCDPE CCDPE
extern volatile unsigned char           CCDPE               __at(0x3A88);
#ifndef _LIB_BUILD
asm("CCDPE equ 03A88h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDPE0                 :1;
        unsigned CCDPE1                 :1;
        unsigned CCDPE2                 :1;
    };
} CCDPEbits_t;
extern volatile CCDPEbits_t CCDPEbits __at(0x3A88);
// bitfield macros
#define _CCDPE_CCDPE0_POSN                                  0x0
#define _CCDPE_CCDPE0_POSITION                              0x0
#define _CCDPE_CCDPE0_SIZE                                  0x1
#define _CCDPE_CCDPE0_LENGTH                                0x1
#define _CCDPE_CCDPE0_MASK                                  0x1
#define _CCDPE_CCDPE1_POSN                                  0x1
#define _CCDPE_CCDPE1_POSITION                              0x1
#define _CCDPE_CCDPE1_SIZE                                  0x1
#define _CCDPE_CCDPE1_LENGTH                                0x1
#define _CCDPE_CCDPE1_MASK                                  0x2
#define _CCDPE_CCDPE2_POSN                                  0x2
#define _CCDPE_CCDPE2_POSITION                              0x2
#define _CCDPE_CCDPE2_SIZE                                  0x1
#define _CCDPE_CCDPE2_LENGTH                                0x1
#define _CCDPE_CCDPE2_MASK                                  0x4

// Register: CCDNE
#define CCDNE CCDNE
extern volatile unsigned char           CCDNE               __at(0x3A89);
#ifndef _LIB_BUILD
asm("CCDNE equ 03A89h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDNE0                 :1;
        unsigned CCDNE1                 :1;
        unsigned CCDNE2                 :1;
    };
} CCDNEbits_t;
extern volatile CCDNEbits_t CCDNEbits __at(0x3A89);
// bitfield macros
#define _CCDNE_CCDNE0_POSN                                  0x0
#define _CCDNE_CCDNE0_POSITION                              0x0
#define _CCDNE_CCDNE0_SIZE                                  0x1
#define _CCDNE_CCDNE0_LENGTH                                0x1
#define _CCDNE_CCDNE0_MASK                                  0x1
#define _CCDNE_CCDNE1_POSN                                  0x1
#define _CCDNE_CCDNE1_POSITION                              0x1
#define _CCDNE_CCDNE1_SIZE                                  0x1
#define _CCDNE_CCDNE1_LENGTH                                0x1
#define _CCDNE_CCDNE1_MASK                                  0x2
#define _CCDNE_CCDNE2_POSN                                  0x2
#define _CCDNE_CCDNE2_POSITION                              0x2
#define _CCDNE_CCDNE2_SIZE                                  0x1
#define _CCDNE_CCDNE2_LENGTH                                0x1
#define _CCDNE_CCDNE2_MASK                                  0x4

// Register: CCDCON
#define CCDCON CCDCON
extern volatile unsigned char           CCDCON              __at(0x3ABE);
#ifndef _LIB_BUILD
asm("CCDCON equ 03ABEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DS                     :2;
        unsigned                        :5;
        unsigned EN                     :1;
    };
    struct {
        unsigned CCDS                   :2;
        unsigned                        :5;
        unsigned CCDEN                  :1;
    };
    struct {
        unsigned SEL0                   :1;
        unsigned SEL1                   :1;
    };
} CCDCONbits_t;
extern volatile CCDCONbits_t CCDCONbits __at(0x3ABE);
// bitfield macros
#define _CCDCON_DS_POSN                                     0x0
#define _CCDCON_DS_POSITION                                 0x0
#define _CCDCON_DS_SIZE                                     0x2
#define _CCDCON_DS_LENGTH                                   0x2
#define _CCDCON_DS_MASK                                     0x3
#define _CCDCON_EN_POSN                                     0x7
#define _CCDCON_EN_POSITION                                 0x7
#define _CCDCON_EN_SIZE                                     0x1
#define _CCDCON_EN_LENGTH                                   0x1
#define _CCDCON_EN_MASK                                     0x80
#define _CCDCON_CCDS_POSN                                   0x0
#define _CCDCON_CCDS_POSITION                               0x0
#define _CCDCON_CCDS_SIZE                                   0x2
#define _CCDCON_CCDS_LENGTH                                 0x2
#define _CCDCON_CCDS_MASK                                   0x3
#define _CCDCON_CCDEN_POSN                                  0x7
#define _CCDCON_CCDEN_POSITION                              0x7
#define _CCDCON_CCDEN_SIZE                                  0x1
#define _CCDCON_CCDEN_LENGTH                                0x1
#define _CCDCON_CCDEN_MASK                                  0x80
#define _CCDCON_SEL0_POSN                                   0x0
#define _CCDCON_SEL0_POSITION                               0x0
#define _CCDCON_SEL0_SIZE                                   0x1
#define _CCDCON_SEL0_LENGTH                                 0x1
#define _CCDCON_SEL0_MASK                                   0x1
#define _CCDCON_SEL1_POSN                                   0x1
#define _CCDCON_SEL1_POSITION                               0x1
#define _CCDCON_SEL1_SIZE                                   0x1
#define _CCDCON_SEL1_LENGTH                                 0x1
#define _CCDCON_SEL1_MASK                                   0x2

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0x3ABF);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 03ABFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0x3ABF);
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

