MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K42/mcu.h
// Register: DMA1SSZH
#define DMA1SSZH DMA1SSZH
extern volatile unsigned char           DMA1SSZH            __at(0x3BF8);
#ifndef _LIB_BUILD
asm("DMA1SSZH equ 03BF8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSZ                    :4;
    };
    struct {
        unsigned DMA1SSZ                :4;
    };
    struct {
        unsigned SSZ8                   :1;
        unsigned SSZ9                   :1;
        unsigned SSZ10                  :1;
        unsigned SSZ11                  :1;
    };
    struct {
        unsigned DMA1SSZ8               :1;
        unsigned DMA1SSZ9               :1;
        unsigned DMA1SSZ10              :1;
        unsigned DMA1SSZ11              :1;
    };
} DMA1SSZHbits_t;
extern volatile DMA1SSZHbits_t DMA1SSZHbits __at(0x3BF8);
// bitfield macros
#define _DMA1SSZH_SSZ_POSN                                  0x0
#define _DMA1SSZH_SSZ_POSITION                              0x0
#define _DMA1SSZH_SSZ_SIZE                                  0x4
#define _DMA1SSZH_SSZ_LENGTH                                0x4
#define _DMA1SSZH_SSZ_MASK                                  0xF
#define _DMA1SSZH_DMA1SSZ_POSN                              0x0
#define _DMA1SSZH_DMA1SSZ_POSITION                          0x0
#define _DMA1SSZH_DMA1SSZ_SIZE                              0x4
#define _DMA1SSZH_DMA1SSZ_LENGTH                            0x4
#define _DMA1SSZH_DMA1SSZ_MASK                              0xF
#define _DMA1SSZH_SSZ8_POSN                                 0x0
#define _DMA1SSZH_SSZ8_POSITION                             0x0
#define _DMA1SSZH_SSZ8_SIZE                                 0x1
#define _DMA1SSZH_SSZ8_LENGTH                               0x1
#define _DMA1SSZH_SSZ8_MASK                                 0x1
#define _DMA1SSZH_SSZ9_POSN                                 0x1
#define _DMA1SSZH_SSZ9_POSITION                             0x1
#define _DMA1SSZH_SSZ9_SIZE                                 0x1
#define _DMA1SSZH_SSZ9_LENGTH                               0x1
#define _DMA1SSZH_SSZ9_MASK                                 0x2
#define _DMA1SSZH_SSZ10_POSN                                0x2
#define _DMA1SSZH_SSZ10_POSITION                            0x2
#define _DMA1SSZH_SSZ10_SIZE                                0x1
#define _DMA1SSZH_SSZ10_LENGTH                              0x1
#define _DMA1SSZH_SSZ10_MASK                                0x4
#define _DMA1SSZH_SSZ11_POSN                                0x3
#define _DMA1SSZH_SSZ11_POSITION                            0x3
#define _DMA1SSZH_SSZ11_SIZE                                0x1
#define _DMA1SSZH_SSZ11_LENGTH                              0x1
#define _DMA1SSZH_SSZ11_MASK                                0x8
#define _DMA1SSZH_DMA1SSZ8_POSN                             0x0
#define _DMA1SSZH_DMA1SSZ8_POSITION                         0x0
#define _DMA1SSZH_DMA1SSZ8_SIZE                             0x1
#define _DMA1SSZH_DMA1SSZ8_LENGTH                           0x1
#define _DMA1SSZH_DMA1SSZ8_MASK                             0x1
#define _DMA1SSZH_DMA1SSZ9_POSN                             0x1
#define _DMA1SSZH_DMA1SSZ9_POSITION                         0x1
#define _DMA1SSZH_DMA1SSZ9_SIZE                             0x1
#define _DMA1SSZH_DMA1SSZ9_LENGTH                           0x1
#define _DMA1SSZH_DMA1SSZ9_MASK                             0x2
#define _DMA1SSZH_DMA1SSZ10_POSN                            0x2
#define _DMA1SSZH_DMA1SSZ10_POSITION                        0x2
#define _DMA1SSZH_DMA1SSZ10_SIZE                            0x1
#define _DMA1SSZH_DMA1SSZ10_LENGTH                          0x1
#define _DMA1SSZH_DMA1SSZ10_MASK                            0x4
#define _DMA1SSZH_DMA1SSZ11_POSN                            0x3
#define _DMA1SSZH_DMA1SSZ11_POSITION                        0x3
#define _DMA1SSZH_DMA1SSZ11_SIZE                            0x1
#define _DMA1SSZH_DMA1SSZ11_LENGTH                          0x1
#define _DMA1SSZH_DMA1SSZ11_MASK                            0x8

// Register: DMA1SSA
#define DMA1SSA DMA1SSA
#ifndef __CCI__
extern volatile __uint24                DMA1SSA             __at(0x3BF9);
#endif
#ifndef _LIB_BUILD
asm("DMA1SSA equ 03BF9h");
#endif

// Register: DMA1SSAL
#define DMA1SSAL DMA1SSAL
extern volatile unsigned char           DMA1SSAL            __at(0x3BF9);
#ifndef _LIB_BUILD
asm("DMA1SSAL equ 03BF9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA0                   :1;
        unsigned SSA1                   :1;
        unsigned SSA2                   :1;
        unsigned SSA3                   :1;
        unsigned SSA4                   :1;
        unsigned SSA5                   :1;
        unsigned SSA6                   :1;
        unsigned SSA7                   :1;
    };
    struct {
        unsigned DMA1SSA                :8;
    };
    struct {
        unsigned DMA1SSA0               :1;
        unsigned DMA1SSA1               :1;
        unsigned DMA1SSA2               :1;
        unsigned DMA1SSA3               :1;
        unsigned DMA1SSA4               :1;
        unsigned DMA1SSA5               :1;
        unsigned DMA1SSA6               :1;
        unsigned DMA1SSA7               :1;
    };
} DMA1SSALbits_t;
extern volatile DMA1SSALbits_t DMA1SSALbits __at(0x3BF9);
// bitfield macros
#define _DMA1SSAL_SSA_POSN                                  0x0
#define _DMA1SSAL_SSA_POSITION                              0x0
#define _DMA1SSAL_SSA_SIZE                                  0x8
#define _DMA1SSAL_SSA_LENGTH                                0x8
#define _DMA1SSAL_SSA_MASK                                  0xFF
#define _DMA1SSAL_SSA0_POSN                                 0x0
#define _DMA1SSAL_SSA0_POSITION                             0x0
#define _DMA1SSAL_SSA0_SIZE                                 0x1
#define _DMA1SSAL_SSA0_LENGTH                               0x1
#define _DMA1SSAL_SSA0_MASK                                 0x1
#define _DMA1SSAL_SSA1_POSN                                 0x1
#define _DMA1SSAL_SSA1_POSITION                             0x1
#define _DMA1SSAL_SSA1_SIZE                                 0x1
#define _DMA1SSAL_SSA1_LENGTH                               0x1
#define _DMA1SSAL_SSA1_MASK                                 0x2
#define _DMA1SSAL_SSA2_POSN                                 0x2
#define _DMA1SSAL_SSA2_POSITION                             0x2
#define _DMA1SSAL_SSA2_SIZE                                 0x1
#define _DMA1SSAL_SSA2_LENGTH                               0x1
#define _DMA1SSAL_SSA2_MASK                                 0x4
#define _DMA1SSAL_SSA3_POSN                                 0x3
#define _DMA1SSAL_SSA3_POSITION                             0x3
#define _DMA1SSAL_SSA3_SIZE                                 0x1
#define _DMA1SSAL_SSA3_LENGTH                               0x1
#define _DMA1SSAL_SSA3_MASK                                 0x8
#define _DMA1SSAL_SSA4_POSN                                 0x4
#define _DMA1SSAL_SSA4_POSITION                             0x4
#define _DMA1SSAL_SSA4_SIZE                                 0x1
#define _DMA1SSAL_SSA4_LENGTH                               0x1
#define _DMA1SSAL_SSA4_MASK                                 0x10
#define _DMA1SSAL_SSA5_POSN                                 0x5
#define _DMA1SSAL_SSA5_POSITION                             0x5
#define _DMA1SSAL_SSA5_SIZE                                 0x1
#define _DMA1SSAL_SSA5_LENGTH                               0x1
#define _DMA1SSAL_SSA5_MASK                                 0x20
#define _DMA1SSAL_SSA6_POSN                                 0x6
#define _DMA1SSAL_SSA6_POSITION                             0x6
#define _DMA1SSAL_SSA6_SIZE                                 0x1
#define _DMA1SSAL_SSA6_LENGTH                               0x1
#define _DMA1SSAL_SSA6_MASK                                 0x40
#define _DMA1SSAL_SSA7_POSN                                 0x7
#define _DMA1SSAL_SSA7_POSITION                             0x7
#define _DMA1SSAL_SSA7_SIZE                                 0x1
#define _DMA1SSAL_SSA7_LENGTH                               0x1
#define _DMA1SSAL_SSA7_MASK                                 0x80
#define _DMA1SSAL_DMA1SSA_POSN                              0x0
#define _DMA1SSAL_DMA1SSA_POSITION                          0x0
#define _DMA1SSAL_DMA1SSA_SIZE                              0x8
#define _DMA1SSAL_DMA1SSA_LENGTH                            0x8
#define _DMA1SSAL_DMA1SSA_MASK                              0xFF
#define _DMA1SSAL_DMA1SSA0_POSN                             0x0
#define _DMA1SSAL_DMA1SSA0_POSITION                         0x0
#define _DMA1SSAL_DMA1SSA0_SIZE                             0x1
#define _DMA1SSAL_DMA1SSA0_LENGTH                           0x1
#define _DMA1SSAL_DMA1SSA0_MASK                             0x1
#define _DMA1SSAL_DMA1SSA1_POSN                             0x1
#define _DMA1SSAL_DMA1SSA1_POSITION                         0x1
#define _DMA1SSAL_DMA1SSA1_SIZE                             0x1
#define _DMA1SSAL_DMA1SSA1_LENGTH                           0x1
#define _DMA1SSAL_DMA1SSA1_MASK                             0x2
#define _DMA1SSAL_DMA1SSA2_POSN                             0x2
#define _DMA1SSAL_DMA1SSA2_POSITION                         0x2
#define _DMA1SSAL_DMA1SSA2_SIZE                             0x1
#define _DMA1SSAL_DMA1SSA2_LENGTH                           0x1
#define _DMA1SSAL_DMA1SSA2_MASK                             0x4
#define _DMA1SSAL_DMA1SSA3_POSN                             0x3
#define _DMA1SSAL_DMA1SSA3_POSITION                         0x3
#define _DMA1SSAL_DMA1SSA3_SIZE                             0x1
#define _DMA1SSAL_DMA1SSA3_LENGTH                           0x1
#define _DMA1SSAL_DMA1SSA3_MASK                             0x8
#define _DMA1SSAL_DMA1SSA4_POSN                             0x4
#define _DMA1SSAL_DMA1SSA4_POSITION                         0x4
#define _DMA1SSAL_DMA1SSA4_SIZE                             0x1
#define _DMA1SSAL_DMA1SSA4_LENGTH                           0x1
#define _DMA1SSAL_DMA1SSA4_MASK                             0x10
#define _DMA1SSAL_DMA1SSA5_POSN                             0x5
#define _DMA1SSAL_DMA1SSA5_POSITION                         0x5
#define _DMA1SSAL_DMA1SSA5_SIZE                             0x1
#define _DMA1SSAL_DMA1SSA5_LENGTH                           0x1
#define _DMA1SSAL_DMA1SSA5_MASK                             0x20
#define _DMA1SSAL_DMA1SSA6_POSN                             0x6
#define _DMA1SSAL_DMA1SSA6_POSITION                         0x6
#define _DMA1SSAL_DMA1SSA6_SIZE                             0x1
#define _DMA1SSAL_DMA1SSA6_LENGTH                           0x1
#define _DMA1SSAL_DMA1SSA6_MASK                             0x40
#define _DMA1SSAL_DMA1SSA7_POSN                             0x7
#define _DMA1SSAL_DMA1SSA7_POSITION                         0x7
#define _DMA1SSAL_DMA1SSA7_SIZE                             0x1
#define _DMA1SSAL_DMA1SSA7_LENGTH                           0x1
#define _DMA1SSAL_DMA1SSA7_MASK                             0x80

// Register: DMA1SSAH
#define DMA1SSAH DMA1SSAH
extern volatile unsigned char           DMA1SSAH            __at(0x3BFA);
#ifndef _LIB_BUILD
asm("DMA1SSAH equ 03BFAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA8                   :1;
        unsigned SSA9                   :1;
        unsigned SSA10                  :1;
        unsigned SSA11                  :1;
        unsigned SSA12                  :1;
        unsigned SSA13                  :1;
        unsigned SSA14                  :1;
        unsigned SSA15                  :1;
    };
    struct {
        unsigned DMA1SSA                :8;
    };
    struct {
        unsigned DMA1SSA8               :1;
        unsigned DMA1SSA9               :1;
        unsigned DMA1SSA10              :1;
        unsigned DMA1SSA11              :1;
        unsigned DMA1SSA12              :1;
        unsigned DMA1SSA13              :1;
        unsigned DMA1SSA14              :1;
        unsigned DMA1SSA15              :1;
    };
} DMA1SSAHbits_t;
extern volatile DMA1SSAHbits_t DMA1SSAHbits __at(0x3BFA);
// bitfield macros
#define _DMA1SSAH_SSA_POSN                                  0x0
#define _DMA1SSAH_SSA_POSITION                              0x0
#define _DMA1SSAH_SSA_SIZE                                  0x8
#define _DMA1SSAH_SSA_LENGTH                                0x8
#define _DMA1SSAH_SSA_MASK                                  0xFF
#define _DMA1SSAH_SSA8_POSN                                 0x0
#define _DMA1SSAH_SSA8_POSITION                             0x0
#define _DMA1SSAH_SSA8_SIZE                                 0x1
#define _DMA1SSAH_SSA8_LENGTH                               0x1
#define _DMA1SSAH_SSA8_MASK                                 0x1
#define _DMA1SSAH_SSA9_POSN                                 0x1
#define _DMA1SSAH_SSA9_POSITION                             0x1
#define _DMA1SSAH_SSA9_SIZE                                 0x1
#define _DMA1SSAH_SSA9_LENGTH                               0x1
#define _DMA1SSAH_SSA9_MASK                                 0x2
#define _DMA1SSAH_SSA10_POSN                                0x2
#define _DMA1SSAH_SSA10_POSITION                            0x2
#define _DMA1SSAH_SSA10_SIZE                                0x1
#define _DMA1SSAH_SSA10_LENGTH                              0x1
#define _DMA1SSAH_SSA10_MASK                                0x4
#define _DMA1SSAH_SSA11_POSN                                0x3
#define _DMA1SSAH_SSA11_POSITION                            0x3
#define _DMA1SSAH_SSA11_SIZE                                0x1
#define _DMA1SSAH_SSA11_LENGTH                              0x1
#define _DMA1SSAH_SSA11_MASK                                0x8
#define _DMA1SSAH_SSA12_POSN                                0x4
#define _DMA1SSAH_SSA12_POSITION                            0x4
#define _DMA1SSAH_SSA12_SIZE                                0x1
#define _DMA1SSAH_SSA12_LENGTH                              0x1
#define _DMA1SSAH_SSA12_MASK                                0x10
#define _DMA1SSAH_SSA13_POSN                                0x5
#define _DMA1SSAH_SSA13_POSITION                            0x5
#define _DMA1SSAH_SSA13_SIZE                                0x1
#define _DMA1SSAH_SSA13_LENGTH                              0x1
#define _DMA1SSAH_SSA13_MASK                                0x20
#define _DMA1SSAH_SSA14_POSN                                0x6
#define _DMA1SSAH_SSA14_POSITION                            0x6
#define _DMA1SSAH_SSA14_SIZE                                0x1
#define _DMA1SSAH_SSA14_LENGTH                              0x1
#define _DMA1SSAH_SSA14_MASK                                0x40
#define _DMA1SSAH_SSA15_POSN                                0x7
#define _DMA1SSAH_SSA15_POSITION                            0x7
#define _DMA1SSAH_SSA15_SIZE                                0x1
#define _DMA1SSAH_SSA15_LENGTH                              0x1
#define _DMA1SSAH_SSA15_MASK                                0x80
#define _DMA1SSAH_DMA1SSA_POSN                              0x0
#define _DMA1SSAH_DMA1SSA_POSITION                          0x0
#define _DMA1SSAH_DMA1SSA_SIZE                              0x8
#define _DMA1SSAH_DMA1SSA_LENGTH                            0x8
#define _DMA1SSAH_DMA1SSA_MASK                              0xFF
#define _DMA1SSAH_DMA1SSA8_POSN                             0x0
#define _DMA1SSAH_DMA1SSA8_POSITION                         0x0
#define _DMA1SSAH_DMA1SSA8_SIZE                             0x1
#define _DMA1SSAH_DMA1SSA8_LENGTH                           0x1
#define _DMA1SSAH_DMA1SSA8_MASK                             0x1
#define _DMA1SSAH_DMA1SSA9_POSN                             0x1
#define _DMA1SSAH_DMA1SSA9_POSITION                         0x1
#define _DMA1SSAH_DMA1SSA9_SIZE                             0x1
#define _DMA1SSAH_DMA1SSA9_LENGTH                           0x1
#define _DMA1SSAH_DMA1SSA9_MASK                             0x2
#define _DMA1SSAH_DMA1SSA10_POSN                            0x2
#define _DMA1SSAH_DMA1SSA10_POSITION                        0x2
#define _DMA1SSAH_DMA1SSA10_SIZE                            0x1
#define _DMA1SSAH_DMA1SSA10_LENGTH                          0x1
#define _DMA1SSAH_DMA1SSA10_MASK                            0x4
#define _DMA1SSAH_DMA1SSA11_POSN                            0x3
#define _DMA1SSAH_DMA1SSA11_POSITION                        0x3
#define _DMA1SSAH_DMA1SSA11_SIZE                            0x1
#define _DMA1SSAH_DMA1SSA11_LENGTH                          0x1
#define _DMA1SSAH_DMA1SSA11_MASK                            0x8
#define _DMA1SSAH_DMA1SSA12_POSN                            0x4
#define _DMA1SSAH_DMA1SSA12_POSITION                        0x4
#define _DMA1SSAH_DMA1SSA12_SIZE                            0x1
#define _DMA1SSAH_DMA1SSA12_LENGTH                          0x1
#define _DMA1SSAH_DMA1SSA12_MASK                            0x10
#define _DMA1SSAH_DMA1SSA13_POSN                            0x5
#define _DMA1SSAH_DMA1SSA13_POSITION                        0x5
#define _DMA1SSAH_DMA1SSA13_SIZE                            0x1
#define _DMA1SSAH_DMA1SSA13_LENGTH                          0x1
#define _DMA1SSAH_DMA1SSA13_MASK                            0x20
#define _DMA1SSAH_DMA1SSA14_POSN                            0x6
#define _DMA1SSAH_DMA1SSA14_POSITION                        0x6
#define _DMA1SSAH_DMA1SSA14_SIZE                            0x1
#define _DMA1SSAH_DMA1SSA14_LENGTH                          0x1
#define _DMA1SSAH_DMA1SSA14_MASK                            0x40
#define _DMA1SSAH_DMA1SSA15_POSN                            0x7
#define _DMA1SSAH_DMA1SSA15_POSITION                        0x7
#define _DMA1SSAH_DMA1SSA15_SIZE                            0x1
#define _DMA1SSAH_DMA1SSA15_LENGTH                          0x1
#define _DMA1SSAH_DMA1SSA15_MASK                            0x80

// Register: DMA1SSAU
#define DMA1SSAU DMA1SSAU
extern volatile unsigned char           DMA1SSAU            __at(0x3BFB);
#ifndef _LIB_BUILD
asm("DMA1SSAU equ 03BFBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :6;
    };
    struct {
        unsigned SSA16                  :1;
        unsigned SSA17                  :1;
        unsigned SSA18                  :1;
        unsigned SSA19                  :1;
        unsigned SSA20                  :1;
        unsigned SSA21                  :1;
    };
    struct {
        unsigned DMA1SSA                :6;
    };
    struct {
        unsigned DMA1SSA16              :1;
        unsigned DMA1SSA17              :1;
        unsigned DMA1SSA18              :1;
        unsigned DMA1SSA19              :1;
        unsigned DMA1SSA20              :1;
        unsigned DMA1SSA21              :1;
    };
} DMA1SSAUbits_t;
extern volatile DMA1SSAUbits_t DMA1SSAUbits __at(0x3BFB);
// bitfield macros
#define _DMA1SSAU_SSA_POSN                                  0x0
#define _DMA1SSAU_SSA_POSITION                              0x0
#define _DMA1SSAU_SSA_SIZE                                  0x6
#define _DMA1SSAU_SSA_LENGTH                                0x6
#define _DMA1SSAU_SSA_MASK                                  0x3F
#define _DMA1SSAU_SSA16_POSN                                0x0
#define _DMA1SSAU_SSA16_POSITION                            0x0
#define _DMA1SSAU_SSA16_SIZE                                0x1
#define _DMA1SSAU_SSA16_LENGTH                              0x1
#define _DMA1SSAU_SSA16_MASK                                0x1
#define _DMA1SSAU_SSA17_POSN                                0x1
#define _DMA1SSAU_SSA17_POSITION                            0x1
#define _DMA1SSAU_SSA17_SIZE                                0x1
#define _DMA1SSAU_SSA17_LENGTH                              0x1
#define _DMA1SSAU_SSA17_MASK                                0x2
#define _DMA1SSAU_SSA18_POSN                                0x2
#define _DMA1SSAU_SSA18_POSITION                            0x2
#define _DMA1SSAU_SSA18_SIZE                                0x1
#define _DMA1SSAU_SSA18_LENGTH                              0x1
#define _DMA1SSAU_SSA18_MASK                                0x4
#define _DMA1SSAU_SSA19_POSN                                0x3
#define _DMA1SSAU_SSA19_POSITION                            0x3
#define _DMA1SSAU_SSA19_SIZE                                0x1
#define _DMA1SSAU_SSA19_LENGTH                              0x1
#define _DMA1SSAU_SSA19_MASK                                0x8
#define _DMA1SSAU_SSA20_POSN                                0x4
#define _DMA1SSAU_SSA20_POSITION                            0x4
#define _DMA1SSAU_SSA20_SIZE                                0x1
#define _DMA1SSAU_SSA20_LENGTH                              0x1
#define _DMA1SSAU_SSA20_MASK                                0x10
#define _DMA1SSAU_SSA21_POSN                                0x5
#define _DMA1SSAU_SSA21_POSITION                            0x5
#define _DMA1SSAU_SSA21_SIZE                                0x1
#define _DMA1SSAU_SSA21_LENGTH                              0x1
#define _DMA1SSAU_SSA21_MASK                                0x20
#define _DMA1SSAU_DMA1SSA_POSN                              0x0
#define _DMA1SSAU_DMA1SSA_POSITION                          0x0
#define _DMA1SSAU_DMA1SSA_SIZE                              0x6
#define _DMA1SSAU_DMA1SSA_LENGTH                            0x6
#define _DMA1SSAU_DMA1SSA_MASK                              0x3F
#define _DMA1SSAU_DMA1SSA16_POSN                            0x0
#define _DMA1SSAU_DMA1SSA16_POSITION                        0x0
#define _DMA1SSAU_DMA1SSA16_SIZE                            0x1
#define _DMA1SSAU_DMA1SSA16_LENGTH                          0x1
#define _DMA1SSAU_DMA1SSA16_MASK                            0x1
#define _DMA1SSAU_DMA1SSA17_POSN                            0x1
#define _DMA1SSAU_DMA1SSA17_POSITION                        0x1
#define _DMA1SSAU_DMA1SSA17_SIZE                            0x1
#define _DMA1SSAU_DMA1SSA17_LENGTH                          0x1
#define _DMA1SSAU_DMA1SSA17_MASK                            0x2
#define _DMA1SSAU_DMA1SSA18_POSN                            0x2
#define _DMA1SSAU_DMA1SSA18_POSITION                        0x2
#define _DMA1SSAU_DMA1SSA18_SIZE                            0x1
#define _DMA1SSAU_DMA1SSA18_LENGTH                          0x1
#define _DMA1SSAU_DMA1SSA18_MASK                            0x4
#define _DMA1SSAU_DMA1SSA19_POSN                            0x3
#define _DMA1SSAU_DMA1SSA19_POSITION                        0x3
#define _DMA1SSAU_DMA1SSA19_SIZE                            0x1
#define _DMA1SSAU_DMA1SSA19_LENGTH                          0x1
#define _DMA1SSAU_DMA1SSA19_MASK                            0x8
#define _DMA1SSAU_DMA1SSA20_POSN                            0x4
#define _DMA1SSAU_DMA1SSA20_POSITION                        0x4
#define _DMA1SSAU_DMA1SSA20_SIZE                            0x1
#define _DMA1SSAU_DMA1SSA20_LENGTH                          0x1
#define _DMA1SSAU_DMA1SSA20_MASK                            0x10
#define _DMA1SSAU_DMA1SSA21_POSN                            0x5
#define _DMA1SSAU_DMA1SSA21_POSITION                        0x5
#define _DMA1SSAU_DMA1SSA21_SIZE                            0x1
#define _DMA1SSAU_DMA1SSA21_LENGTH                          0x1
#define _DMA1SSAU_DMA1SSA21_MASK                            0x20

