MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K42/mcu.h
extern volatile U1FIFObits_t U1FIFObits __at(0x3DF7);
// bitfield macros
#define _U1FIFO_RXBF_POSN                                   0x0
#define _U1FIFO_RXBF_POSITION                               0x0
#define _U1FIFO_RXBF_SIZE                                   0x1
#define _U1FIFO_RXBF_LENGTH                                 0x1
#define _U1FIFO_RXBF_MASK                                   0x1
#define _U1FIFO_RXBE_POSN                                   0x1
#define _U1FIFO_RXBE_POSITION                               0x1
#define _U1FIFO_RXBE_SIZE                                   0x1
#define _U1FIFO_RXBE_LENGTH                                 0x1
#define _U1FIFO_RXBE_MASK                                   0x2
#define _U1FIFO_XON_POSN                                    0x2
#define _U1FIFO_XON_POSITION                                0x2
#define _U1FIFO_XON_SIZE                                    0x1
#define _U1FIFO_XON_LENGTH                                  0x1
#define _U1FIFO_XON_MASK                                    0x4
#define _U1FIFO_RXIDL_POSN                                  0x3
#define _U1FIFO_RXIDL_POSITION                              0x3
#define _U1FIFO_RXIDL_SIZE                                  0x1
#define _U1FIFO_RXIDL_LENGTH                                0x1
#define _U1FIFO_RXIDL_MASK                                  0x8
#define _U1FIFO_TXBF_POSN                                   0x4
#define _U1FIFO_TXBF_POSITION                               0x4
#define _U1FIFO_TXBF_SIZE                                   0x1
#define _U1FIFO_TXBF_LENGTH                                 0x1
#define _U1FIFO_TXBF_MASK                                   0x10
#define _U1FIFO_TXBE_POSN                                   0x5
#define _U1FIFO_TXBE_POSITION                               0x5
#define _U1FIFO_TXBE_SIZE                                   0x1
#define _U1FIFO_TXBE_LENGTH                                 0x1
#define _U1FIFO_TXBE_MASK                                   0x20
#define _U1FIFO_STPMD_POSN                                  0x6
#define _U1FIFO_STPMD_POSITION                              0x6
#define _U1FIFO_STPMD_SIZE                                  0x1
#define _U1FIFO_STPMD_LENGTH                                0x1
#define _U1FIFO_STPMD_MASK                                  0x40
#define _U1FIFO_TXWRE_POSN                                  0x7
#define _U1FIFO_TXWRE_POSITION                              0x7
#define _U1FIFO_TXWRE_SIZE                                  0x1
#define _U1FIFO_TXWRE_LENGTH                                0x1
#define _U1FIFO_TXWRE_MASK                                  0x80
#define _U1FIFO_U1RXBF_POSN                                 0x0
#define _U1FIFO_U1RXBF_POSITION                             0x0
#define _U1FIFO_U1RXBF_SIZE                                 0x1
#define _U1FIFO_U1RXBF_LENGTH                               0x1
#define _U1FIFO_U1RXBF_MASK                                 0x1
#define _U1FIFO_U1RXBE_POSN                                 0x1
#define _U1FIFO_U1RXBE_POSITION                             0x1
#define _U1FIFO_U1RXBE_SIZE                                 0x1
#define _U1FIFO_U1RXBE_LENGTH                               0x1
#define _U1FIFO_U1RXBE_MASK                                 0x2
#define _U1FIFO_U1XON_POSN                                  0x2
#define _U1FIFO_U1XON_POSITION                              0x2
#define _U1FIFO_U1XON_SIZE                                  0x1
#define _U1FIFO_U1XON_LENGTH                                0x1
#define _U1FIFO_U1XON_MASK                                  0x4
#define _U1FIFO_U1RXIDL_POSN                                0x3
#define _U1FIFO_U1RXIDL_POSITION                            0x3
#define _U1FIFO_U1RXIDL_SIZE                                0x1
#define _U1FIFO_U1RXIDL_LENGTH                              0x1
#define _U1FIFO_U1RXIDL_MASK                                0x8
#define _U1FIFO_U1TXBF_POSN                                 0x4
#define _U1FIFO_U1TXBF_POSITION                             0x4
#define _U1FIFO_U1TXBF_SIZE                                 0x1
#define _U1FIFO_U1TXBF_LENGTH                               0x1
#define _U1FIFO_U1TXBF_MASK                                 0x10
#define _U1FIFO_U1TXBE_POSN                                 0x5
#define _U1FIFO_U1TXBE_POSITION                             0x5
#define _U1FIFO_U1TXBE_SIZE                                 0x1
#define _U1FIFO_U1TXBE_LENGTH                               0x1
#define _U1FIFO_U1TXBE_MASK                                 0x20
#define _U1FIFO_U1STPMD_POSN                                0x6
#define _U1FIFO_U1STPMD_POSITION                            0x6
#define _U1FIFO_U1STPMD_SIZE                                0x1
#define _U1FIFO_U1STPMD_LENGTH                              0x1
#define _U1FIFO_U1STPMD_MASK                                0x40
#define _U1FIFO_U1TXWRE_POSN                                0x7
#define _U1FIFO_U1TXWRE_POSITION                            0x7
#define _U1FIFO_U1TXWRE_SIZE                                0x1
#define _U1FIFO_U1TXWRE_LENGTH                              0x1
#define _U1FIFO_U1TXWRE_MASK                                0x80
#define _U1FIFO_U1RCIDL_POSN                                0x3
#define _U1FIFO_U1RCIDL_POSITION                            0x3
#define _U1FIFO_U1RCIDL_SIZE                                0x1
#define _U1FIFO_U1RCIDL_LENGTH                              0x1
#define _U1FIFO_U1RCIDL_MASK                                0x8
#define _U1FIFO_RCIDL_POSN                                  0x3
#define _U1FIFO_RCIDL_POSITION                              0x3
#define _U1FIFO_RCIDL_SIZE                                  0x1
#define _U1FIFO_RCIDL_LENGTH                                0x1
#define _U1FIFO_RCIDL_MASK                                  0x8

// Register: U1UIR
#define U1UIR U1UIR
extern volatile unsigned char           U1UIR               __at(0x3DF8);
#ifndef _LIB_BUILD
asm("U1UIR equ 03DF8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ABDIE                  :1;
        unsigned                        :3;
        unsigned ABDIF                  :1;
        unsigned WUIF                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned U1ABDIE                :1;
        unsigned                        :3;
        unsigned U1ABDIF                :1;
        unsigned U1WUIF                 :1;
    };
} U1UIRbits_t;
