MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K42/mcu.h
extern volatile SMT1TMRLbits_t SMT1TMRLbits __at(0x3F12);
// bitfield macros
#define _SMT1TMRL_TMR_POSN                                  0x0
#define _SMT1TMRL_TMR_POSITION                              0x0
#define _SMT1TMRL_TMR_SIZE                                  0x8
#define _SMT1TMRL_TMR_LENGTH                                0x8
#define _SMT1TMRL_TMR_MASK                                  0xFF
#define _SMT1TMRL_TMR0_POSN                                 0x0
#define _SMT1TMRL_TMR0_POSITION                             0x0
#define _SMT1TMRL_TMR0_SIZE                                 0x1
#define _SMT1TMRL_TMR0_LENGTH                               0x1
#define _SMT1TMRL_TMR0_MASK                                 0x1
#define _SMT1TMRL_TMR1_POSN                                 0x1
#define _SMT1TMRL_TMR1_POSITION                             0x1
#define _SMT1TMRL_TMR1_SIZE                                 0x1
#define _SMT1TMRL_TMR1_LENGTH                               0x1
#define _SMT1TMRL_TMR1_MASK                                 0x2
#define _SMT1TMRL_TMR2_POSN                                 0x2
#define _SMT1TMRL_TMR2_POSITION                             0x2
#define _SMT1TMRL_TMR2_SIZE                                 0x1
#define _SMT1TMRL_TMR2_LENGTH                               0x1
#define _SMT1TMRL_TMR2_MASK                                 0x4
#define _SMT1TMRL_TMR3_POSN                                 0x3
#define _SMT1TMRL_TMR3_POSITION                             0x3
#define _SMT1TMRL_TMR3_SIZE                                 0x1
#define _SMT1TMRL_TMR3_LENGTH                               0x1
#define _SMT1TMRL_TMR3_MASK                                 0x8
#define _SMT1TMRL_TMR4_POSN                                 0x4
#define _SMT1TMRL_TMR4_POSITION                             0x4
#define _SMT1TMRL_TMR4_SIZE                                 0x1
#define _SMT1TMRL_TMR4_LENGTH                               0x1
#define _SMT1TMRL_TMR4_MASK                                 0x10
#define _SMT1TMRL_TMR5_POSN                                 0x5
#define _SMT1TMRL_TMR5_POSITION                             0x5
#define _SMT1TMRL_TMR5_SIZE                                 0x1
#define _SMT1TMRL_TMR5_LENGTH                               0x1
#define _SMT1TMRL_TMR5_MASK                                 0x20
#define _SMT1TMRL_TMR6_POSN                                 0x6
#define _SMT1TMRL_TMR6_POSITION                             0x6
#define _SMT1TMRL_TMR6_SIZE                                 0x1
#define _SMT1TMRL_TMR6_LENGTH                               0x1
#define _SMT1TMRL_TMR6_MASK                                 0x40
#define _SMT1TMRL_TMR7_POSN                                 0x7
#define _SMT1TMRL_TMR7_POSITION                             0x7
#define _SMT1TMRL_TMR7_SIZE                                 0x1
#define _SMT1TMRL_TMR7_LENGTH                               0x1
#define _SMT1TMRL_TMR7_MASK                                 0x80
#define _SMT1TMRL_SMT1TMR_POSN                              0x0
#define _SMT1TMRL_SMT1TMR_POSITION                          0x0
#define _SMT1TMRL_SMT1TMR_SIZE                              0x8
#define _SMT1TMRL_SMT1TMR_LENGTH                            0x8
#define _SMT1TMRL_SMT1TMR_MASK                              0xFF
#define _SMT1TMRL_SMT1TMR0_POSN                             0x0
#define _SMT1TMRL_SMT1TMR0_POSITION                         0x0
#define _SMT1TMRL_SMT1TMR0_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR0_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR0_MASK                             0x1
#define _SMT1TMRL_SMT1TMR1_POSN                             0x1
#define _SMT1TMRL_SMT1TMR1_POSITION                         0x1
#define _SMT1TMRL_SMT1TMR1_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR1_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR1_MASK                             0x2
#define _SMT1TMRL_SMT1TMR2_POSN                             0x2
#define _SMT1TMRL_SMT1TMR2_POSITION                         0x2
#define _SMT1TMRL_SMT1TMR2_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR2_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR2_MASK                             0x4
#define _SMT1TMRL_SMT1TMR3_POSN                             0x3
#define _SMT1TMRL_SMT1TMR3_POSITION                         0x3
#define _SMT1TMRL_SMT1TMR3_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR3_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR3_MASK                             0x8
#define _SMT1TMRL_SMT1TMR4_POSN                             0x4
#define _SMT1TMRL_SMT1TMR4_POSITION                         0x4
#define _SMT1TMRL_SMT1TMR4_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR4_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR4_MASK                             0x10
#define _SMT1TMRL_SMT1TMR5_POSN                             0x5
#define _SMT1TMRL_SMT1TMR5_POSITION                         0x5
#define _SMT1TMRL_SMT1TMR5_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR5_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR5_MASK                             0x20
#define _SMT1TMRL_SMT1TMR6_POSN                             0x6
#define _SMT1TMRL_SMT1TMR6_POSITION                         0x6
#define _SMT1TMRL_SMT1TMR6_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR6_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR6_MASK                             0x40
#define _SMT1TMRL_SMT1TMR7_POSN                             0x7
#define _SMT1TMRL_SMT1TMR7_POSITION                         0x7
#define _SMT1TMRL_SMT1TMR7_SIZE                             0x1
#define _SMT1TMRL_SMT1TMR7_LENGTH                           0x1
#define _SMT1TMRL_SMT1TMR7_MASK                             0x80

// Register: SMT1TMRH
#define SMT1TMRH SMT1TMRH
extern volatile unsigned char           SMT1TMRH            __at(0x3F13);
#ifndef _LIB_BUILD
asm("SMT1TMRH equ 03F13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned TMR8                   :1;
        unsigned TMR9                   :1;
        unsigned TMR10                  :1;
        unsigned TMR11                  :1;
        unsigned TMR12                  :1;
        unsigned TMR13                  :1;
        unsigned TMR14                  :1;
        unsigned TMR15                  :1;
    };
    struct {
        unsigned SMT1TMR                :8;
    };
    struct {
        unsigned SMT1TMR8               :1;
        unsigned SMT1TMR9               :1;
        unsigned SMT1TMR10              :1;
        unsigned SMT1TMR11              :1;
        unsigned SMT1TMR12              :1;
        unsigned SMT1TMR13              :1;
        unsigned SMT1TMR14              :1;
        unsigned SMT1TMR15              :1;
    };
} SMT1TMRHbits_t;
extern volatile SMT1TMRHbits_t SMT1TMRHbits __at(0x3F13);
// bitfield macros
#define _SMT1TMRH_TMR_POSN                                  0x0
#define _SMT1TMRH_TMR_POSITION                              0x0
#define _SMT1TMRH_TMR_SIZE                                  0x8
#define _SMT1TMRH_TMR_LENGTH                                0x8
#define _SMT1TMRH_TMR_MASK                                  0xFF
#define _SMT1TMRH_TMR8_POSN                                 0x0
#define _SMT1TMRH_TMR8_POSITION                             0x0
#define _SMT1TMRH_TMR8_SIZE                                 0x1
#define _SMT1TMRH_TMR8_LENGTH                               0x1
#define _SMT1TMRH_TMR8_MASK                                 0x1
#define _SMT1TMRH_TMR9_POSN                                 0x1
#define _SMT1TMRH_TMR9_POSITION                             0x1
#define _SMT1TMRH_TMR9_SIZE                                 0x1
#define _SMT1TMRH_TMR9_LENGTH                               0x1
#define _SMT1TMRH_TMR9_MASK                                 0x2
#define _SMT1TMRH_TMR10_POSN                                0x2
#define _SMT1TMRH_TMR10_POSITION                            0x2
#define _SMT1TMRH_TMR10_SIZE                                0x1
#define _SMT1TMRH_TMR10_LENGTH                              0x1
#define _SMT1TMRH_TMR10_MASK                                0x4
#define _SMT1TMRH_TMR11_POSN                                0x3
#define _SMT1TMRH_TMR11_POSITION                            0x3
#define _SMT1TMRH_TMR11_SIZE                                0x1
#define _SMT1TMRH_TMR11_LENGTH                              0x1
#define _SMT1TMRH_TMR11_MASK                                0x8
#define _SMT1TMRH_TMR12_POSN                                0x4
#define _SMT1TMRH_TMR12_POSITION                            0x4
#define _SMT1TMRH_TMR12_SIZE                                0x1
#define _SMT1TMRH_TMR12_LENGTH                              0x1
#define _SMT1TMRH_TMR12_MASK                                0x10
#define _SMT1TMRH_TMR13_POSN                                0x5
#define _SMT1TMRH_TMR13_POSITION                            0x5
#define _SMT1TMRH_TMR13_SIZE                                0x1
#define _SMT1TMRH_TMR13_LENGTH                              0x1
#define _SMT1TMRH_TMR13_MASK                                0x20
#define _SMT1TMRH_TMR14_POSN                                0x6
#define _SMT1TMRH_TMR14_POSITION                            0x6
#define _SMT1TMRH_TMR14_SIZE                                0x1
#define _SMT1TMRH_TMR14_LENGTH                              0x1
#define _SMT1TMRH_TMR14_MASK                                0x40
#define _SMT1TMRH_TMR15_POSN                                0x7
#define _SMT1TMRH_TMR15_POSITION                            0x7
#define _SMT1TMRH_TMR15_SIZE                                0x1
#define _SMT1TMRH_TMR15_LENGTH                              0x1
#define _SMT1TMRH_TMR15_MASK                                0x80
#define _SMT1TMRH_SMT1TMR_POSN                              0x0
#define _SMT1TMRH_SMT1TMR_POSITION                          0x0
#define _SMT1TMRH_SMT1TMR_SIZE                              0x8
#define _SMT1TMRH_SMT1TMR_LENGTH                            0x8
#define _SMT1TMRH_SMT1TMR_MASK                              0xFF
#define _SMT1TMRH_SMT1TMR8_POSN                             0x0
#define _SMT1TMRH_SMT1TMR8_POSITION                         0x0
#define _SMT1TMRH_SMT1TMR8_SIZE                             0x1
#define _SMT1TMRH_SMT1TMR8_LENGTH                           0x1
#define _SMT1TMRH_SMT1TMR8_MASK                             0x1
#define _SMT1TMRH_SMT1TMR9_POSN                             0x1
#define _SMT1TMRH_SMT1TMR9_POSITION                         0x1
#define _SMT1TMRH_SMT1TMR9_SIZE                             0x1
#define _SMT1TMRH_SMT1TMR9_LENGTH                           0x1
#define _SMT1TMRH_SMT1TMR9_MASK                             0x2
#define _SMT1TMRH_SMT1TMR10_POSN                            0x2
#define _SMT1TMRH_SMT1TMR10_POSITION                        0x2
#define _SMT1TMRH_SMT1TMR10_SIZE                            0x1
#define _SMT1TMRH_SMT1TMR10_LENGTH                          0x1
#define _SMT1TMRH_SMT1TMR10_MASK                            0x4
#define _SMT1TMRH_SMT1TMR11_POSN                            0x3
#define _SMT1TMRH_SMT1TMR11_POSITION                        0x3
#define _SMT1TMRH_SMT1TMR11_SIZE                            0x1
#define _SMT1TMRH_SMT1TMR11_LENGTH                          0x1
#define _SMT1TMRH_SMT1TMR11_MASK                            0x8
#define _SMT1TMRH_SMT1TMR12_POSN                            0x4
#define _SMT1TMRH_SMT1TMR12_POSITION                        0x4
#define _SMT1TMRH_SMT1TMR12_SIZE                            0x1
#define _SMT1TMRH_SMT1TMR12_LENGTH                          0x1
#define _SMT1TMRH_SMT1TMR12_MASK                            0x10
#define _SMT1TMRH_SMT1TMR13_POSN                            0x5
#define _SMT1TMRH_SMT1TMR13_POSITION                        0x5
#define _SMT1TMRH_SMT1TMR13_SIZE                            0x1
#define _SMT1TMRH_SMT1TMR13_LENGTH                          0x1
#define _SMT1TMRH_SMT1TMR13_MASK                            0x20
#define _SMT1TMRH_SMT1TMR14_POSN                            0x6
#define _SMT1TMRH_SMT1TMR14_POSITION                        0x6
#define _SMT1TMRH_SMT1TMR14_SIZE                            0x1
#define _SMT1TMRH_SMT1TMR14_LENGTH                          0x1
#define _SMT1TMRH_SMT1TMR14_MASK                            0x40
#define _SMT1TMRH_SMT1TMR15_POSN                            0x7
#define _SMT1TMRH_SMT1TMR15_POSITION                        0x7
#define _SMT1TMRH_SMT1TMR15_SIZE                            0x1
#define _SMT1TMRH_SMT1TMR15_LENGTH                          0x1
#define _SMT1TMRH_SMT1TMR15_MASK                            0x80

