MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K42/mcu.h
extern volatile CCPTMRS1bits_t CCPTMRS1bits __at(0x3F5F);
// bitfield macros
#define _CCPTMRS1_P5TSEL_POSN                               0x0
#define _CCPTMRS1_P5TSEL_POSITION                           0x0
#define _CCPTMRS1_P5TSEL_SIZE                               0x2
#define _CCPTMRS1_P5TSEL_LENGTH                             0x2
#define _CCPTMRS1_P5TSEL_MASK                               0x3
#define _CCPTMRS1_P6TSEL_POSN                               0x2
#define _CCPTMRS1_P6TSEL_POSITION                           0x2
#define _CCPTMRS1_P6TSEL_SIZE                               0x2
#define _CCPTMRS1_P6TSEL_LENGTH                             0x2
#define _CCPTMRS1_P6TSEL_MASK                               0xC
#define _CCPTMRS1_P7TSEL_POSN                               0x4
#define _CCPTMRS1_P7TSEL_POSITION                           0x4
#define _CCPTMRS1_P7TSEL_SIZE                               0x2
#define _CCPTMRS1_P7TSEL_LENGTH                             0x2
#define _CCPTMRS1_P7TSEL_MASK                               0x30
#define _CCPTMRS1_P8TSEL_POSN                               0x6
#define _CCPTMRS1_P8TSEL_POSITION                           0x6
#define _CCPTMRS1_P8TSEL_SIZE                               0x2
#define _CCPTMRS1_P8TSEL_LENGTH                             0x2
#define _CCPTMRS1_P8TSEL_MASK                               0xC0
#define _CCPTMRS1_P5TSEL0_POSN                              0x0
#define _CCPTMRS1_P5TSEL0_POSITION                          0x0
#define _CCPTMRS1_P5TSEL0_SIZE                              0x1
#define _CCPTMRS1_P5TSEL0_LENGTH                            0x1
#define _CCPTMRS1_P5TSEL0_MASK                              0x1
#define _CCPTMRS1_P5TSEL1_POSN                              0x1
#define _CCPTMRS1_P5TSEL1_POSITION                          0x1
#define _CCPTMRS1_P5TSEL1_SIZE                              0x1
#define _CCPTMRS1_P5TSEL1_LENGTH                            0x1
#define _CCPTMRS1_P5TSEL1_MASK                              0x2
#define _CCPTMRS1_P6TSEL0_POSN                              0x2
#define _CCPTMRS1_P6TSEL0_POSITION                          0x2
#define _CCPTMRS1_P6TSEL0_SIZE                              0x1
#define _CCPTMRS1_P6TSEL0_LENGTH                            0x1
#define _CCPTMRS1_P6TSEL0_MASK                              0x4
#define _CCPTMRS1_P6TSEL1_POSN                              0x3
#define _CCPTMRS1_P6TSEL1_POSITION                          0x3
#define _CCPTMRS1_P6TSEL1_SIZE                              0x1
#define _CCPTMRS1_P6TSEL1_LENGTH                            0x1
#define _CCPTMRS1_P6TSEL1_MASK                              0x8
#define _CCPTMRS1_P7TSEL0_POSN                              0x4
#define _CCPTMRS1_P7TSEL0_POSITION                          0x4
#define _CCPTMRS1_P7TSEL0_SIZE                              0x1
#define _CCPTMRS1_P7TSEL0_LENGTH                            0x1
#define _CCPTMRS1_P7TSEL0_MASK                              0x10
#define _CCPTMRS1_P7TSEL1_POSN                              0x5
#define _CCPTMRS1_P7TSEL1_POSITION                          0x5
#define _CCPTMRS1_P7TSEL1_SIZE                              0x1
#define _CCPTMRS1_P7TSEL1_LENGTH                            0x1
#define _CCPTMRS1_P7TSEL1_MASK                              0x20
#define _CCPTMRS1_P8TSEL0_POSN                              0x6
#define _CCPTMRS1_P8TSEL0_POSITION                          0x6
#define _CCPTMRS1_P8TSEL0_SIZE                              0x1
#define _CCPTMRS1_P8TSEL0_LENGTH                            0x1
#define _CCPTMRS1_P8TSEL0_MASK                              0x40
#define _CCPTMRS1_P8TSEL1_POSN                              0x7
#define _CCPTMRS1_P8TSEL1_POSITION                          0x7
#define _CCPTMRS1_P8TSEL1_SIZE                              0x1
#define _CCPTMRS1_P8TSEL1_LENGTH                            0x1
#define _CCPTMRS1_P8TSEL1_MASK                              0x80

// Register: PWM8DC
#define PWM8DC PWM8DC
extern volatile unsigned short          PWM8DC              __at(0x3F60);
#ifndef _LIB_BUILD
asm("PWM8DC equ 03F60h");
#endif

// Register: PWM8DCL
#define PWM8DCL PWM8DCL
extern volatile unsigned char           PWM8DCL             __at(0x3F60);
#ifndef _LIB_BUILD
asm("PWM8DCL equ 03F60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned DC                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned DC0                    :1;
        unsigned DC1                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWM8DC0                :1;
        unsigned PWM8DC1                :1;
    };
    struct {
        unsigned                        :6;
        unsigned PWMPW0                 :1;
        unsigned PWMPW1                 :1;
    };
} PWM8DCLbits_t;
extern volatile PWM8DCLbits_t PWM8DCLbits __at(0x3F60);
// bitfield macros
#define _PWM8DCL_DC_POSN                                    0x6
#define _PWM8DCL_DC_POSITION                                0x6
#define _PWM8DCL_DC_SIZE                                    0x2
#define _PWM8DCL_DC_LENGTH                                  0x2
#define _PWM8DCL_DC_MASK                                    0xC0
#define _PWM8DCL_DC0_POSN                                   0x6
#define _PWM8DCL_DC0_POSITION                               0x6
#define _PWM8DCL_DC0_SIZE                                   0x1
#define _PWM8DCL_DC0_LENGTH                                 0x1
#define _PWM8DCL_DC0_MASK                                   0x40
#define _PWM8DCL_DC1_POSN                                   0x7
#define _PWM8DCL_DC1_POSITION                               0x7
#define _PWM8DCL_DC1_SIZE                                   0x1
#define _PWM8DCL_DC1_LENGTH                                 0x1
#define _PWM8DCL_DC1_MASK                                   0x80
#define _PWM8DCL_PWM8DC0_POSN                               0x6
#define _PWM8DCL_PWM8DC0_POSITION                           0x6
#define _PWM8DCL_PWM8DC0_SIZE                               0x1
#define _PWM8DCL_PWM8DC0_LENGTH                             0x1
#define _PWM8DCL_PWM8DC0_MASK                               0x40
#define _PWM8DCL_PWM8DC1_POSN                               0x7
#define _PWM8DCL_PWM8DC1_POSITION                           0x7
#define _PWM8DCL_PWM8DC1_SIZE                               0x1
#define _PWM8DCL_PWM8DC1_LENGTH                             0x1
#define _PWM8DCL_PWM8DC1_MASK                               0x80
#define _PWM8DCL_PWMPW0_POSN                                0x6
#define _PWM8DCL_PWMPW0_POSITION                            0x6
#define _PWM8DCL_PWMPW0_SIZE                                0x1
#define _PWM8DCL_PWMPW0_LENGTH                              0x1
#define _PWM8DCL_PWMPW0_MASK                                0x40
#define _PWM8DCL_PWMPW1_POSN                                0x7
#define _PWM8DCL_PWMPW1_POSITION                            0x7
#define _PWM8DCL_PWMPW1_SIZE                                0x1
#define _PWM8DCL_PWMPW1_LENGTH                              0x1
#define _PWM8DCL_PWMPW1_MASK                                0x80

