MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K42/mcu.h
extern volatile TMR3CLKbits_t TMR3CLKbits __at(0x3FA9);
// bitfield macros
#define _TMR3CLK_CS_POSN                                    0x0
#define _TMR3CLK_CS_POSITION                                0x0
#define _TMR3CLK_CS_SIZE                                    0x8
#define _TMR3CLK_CS_LENGTH                                  0x8
#define _TMR3CLK_CS_MASK                                    0xFF
#define _TMR3CLK_T3CS0_POSN                                 0x0
#define _TMR3CLK_T3CS0_POSITION                             0x0
#define _TMR3CLK_T3CS0_SIZE                                 0x1
#define _TMR3CLK_T3CS0_LENGTH                               0x1
#define _TMR3CLK_T3CS0_MASK                                 0x1
#define _TMR3CLK_T3CS1_POSN                                 0x1
#define _TMR3CLK_T3CS1_POSITION                             0x1
#define _TMR3CLK_T3CS1_SIZE                                 0x1
#define _TMR3CLK_T3CS1_LENGTH                               0x1
#define _TMR3CLK_T3CS1_MASK                                 0x2
#define _TMR3CLK_T3CS2_POSN                                 0x2
#define _TMR3CLK_T3CS2_POSITION                             0x2
#define _TMR3CLK_T3CS2_SIZE                                 0x1
#define _TMR3CLK_T3CS2_LENGTH                               0x1
#define _TMR3CLK_T3CS2_MASK                                 0x4
#define _TMR3CLK_T3CS3_POSN                                 0x3
#define _TMR3CLK_T3CS3_POSITION                             0x3
#define _TMR3CLK_T3CS3_SIZE                                 0x1
#define _TMR3CLK_T3CS3_LENGTH                               0x1
#define _TMR3CLK_T3CS3_MASK                                 0x8
#define _TMR3CLK_T3CS4_POSN                                 0x4
#define _TMR3CLK_T3CS4_POSITION                             0x4
#define _TMR3CLK_T3CS4_SIZE                                 0x1
#define _TMR3CLK_T3CS4_LENGTH                               0x1
#define _TMR3CLK_T3CS4_MASK                                 0x10
#define _TMR3CLK_CS0_POSN                                   0x0
#define _TMR3CLK_CS0_POSITION                               0x0
#define _TMR3CLK_CS0_SIZE                                   0x1
#define _TMR3CLK_CS0_LENGTH                                 0x1
#define _TMR3CLK_CS0_MASK                                   0x1
#define _TMR3CLK_CS1_POSN                                   0x1
#define _TMR3CLK_CS1_POSITION                               0x1
#define _TMR3CLK_CS1_SIZE                                   0x1
#define _TMR3CLK_CS1_LENGTH                                 0x1
#define _TMR3CLK_CS1_MASK                                   0x2
#define _TMR3CLK_CS2_POSN                                   0x2
#define _TMR3CLK_CS2_POSITION                               0x2
#define _TMR3CLK_CS2_SIZE                                   0x1
#define _TMR3CLK_CS2_LENGTH                                 0x1
#define _TMR3CLK_CS2_MASK                                   0x4
#define _TMR3CLK_CS3_POSN                                   0x3
#define _TMR3CLK_CS3_POSITION                               0x3
#define _TMR3CLK_CS3_SIZE                                   0x1
#define _TMR3CLK_CS3_LENGTH                                 0x1
#define _TMR3CLK_CS3_MASK                                   0x8
#define _TMR3CLK_CS4_POSN                                   0x4
#define _TMR3CLK_CS4_POSITION                               0x4
#define _TMR3CLK_CS4_SIZE                                   0x1
#define _TMR3CLK_CS4_LENGTH                                 0x1
#define _TMR3CLK_CS4_MASK                                   0x10
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T3CS0                  :1;
        unsigned T3CS1                  :1;
        unsigned T3CS2                  :1;
        unsigned T3CS3                  :1;
        unsigned T3CS4                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
    };
} PR3bits_t;
extern volatile PR3bits_t PR3bits __at(0x3FA9);
// bitfield macros
#define _PR3_CS_POSN                                        0x0
#define _PR3_CS_POSITION                                    0x0
#define _PR3_CS_SIZE                                        0x8
#define _PR3_CS_LENGTH                                      0x8
#define _PR3_CS_MASK                                        0xFF
#define _PR3_T3CS0_POSN                                     0x0
#define _PR3_T3CS0_POSITION                                 0x0
#define _PR3_T3CS0_SIZE                                     0x1
#define _PR3_T3CS0_LENGTH                                   0x1
#define _PR3_T3CS0_MASK                                     0x1
#define _PR3_T3CS1_POSN                                     0x1
#define _PR3_T3CS1_POSITION                                 0x1
#define _PR3_T3CS1_SIZE                                     0x1
#define _PR3_T3CS1_LENGTH                                   0x1
#define _PR3_T3CS1_MASK                                     0x2
#define _PR3_T3CS2_POSN                                     0x2
#define _PR3_T3CS2_POSITION                                 0x2
#define _PR3_T3CS2_SIZE                                     0x1
#define _PR3_T3CS2_LENGTH                                   0x1
#define _PR3_T3CS2_MASK                                     0x4
#define _PR3_T3CS3_POSN                                     0x3
#define _PR3_T3CS3_POSITION                                 0x3
#define _PR3_T3CS3_SIZE                                     0x1
#define _PR3_T3CS3_LENGTH                                   0x1
#define _PR3_T3CS3_MASK                                     0x8
#define _PR3_T3CS4_POSN                                     0x4
#define _PR3_T3CS4_POSITION                                 0x4
#define _PR3_T3CS4_SIZE                                     0x1
#define _PR3_T3CS4_LENGTH                                   0x1
#define _PR3_T3CS4_MASK                                     0x10
#define _PR3_CS0_POSN                                       0x0
#define _PR3_CS0_POSITION                                   0x0
#define _PR3_CS0_SIZE                                       0x1
#define _PR3_CS0_LENGTH                                     0x1
#define _PR3_CS0_MASK                                       0x1
#define _PR3_CS1_POSN                                       0x1
#define _PR3_CS1_POSITION                                   0x1
#define _PR3_CS1_SIZE                                       0x1
#define _PR3_CS1_LENGTH                                     0x1
#define _PR3_CS1_MASK                                       0x2
#define _PR3_CS2_POSN                                       0x2
#define _PR3_CS2_POSITION                                   0x2
#define _PR3_CS2_SIZE                                       0x1
#define _PR3_CS2_LENGTH                                     0x1
#define _PR3_CS2_MASK                                       0x4
#define _PR3_CS3_POSN                                       0x3
#define _PR3_CS3_POSITION                                   0x3
#define _PR3_CS3_SIZE                                       0x1
#define _PR3_CS3_LENGTH                                     0x1
#define _PR3_CS3_MASK                                       0x8
#define _PR3_CS4_POSN                                       0x4
#define _PR3_CS4_POSITION                                   0x4
#define _PR3_CS4_SIZE                                       0x1
#define _PR3_CS4_LENGTH                                     0x1
#define _PR3_CS4_MASK                                       0x10

// Register: T2TMR
#define T2TMR T2TMR
extern volatile unsigned char           T2TMR               __at(0x3FAA);
#ifndef _LIB_BUILD
asm("T2TMR equ 03FAAh");
#endif
// aliases
extern volatile unsigned char           TMR2                __at(0x3FAA);
#ifndef _LIB_BUILD
asm("TMR2 equ 03FAAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR2                   :8;
    };
} T2TMRbits_t;
extern volatile T2TMRbits_t T2TMRbits __at(0x3FAA);
// bitfield macros
#define _T2TMR_TMR2_POSN                                    0x0
#define _T2TMR_TMR2_POSITION                                0x0
#define _T2TMR_TMR2_SIZE                                    0x8
#define _T2TMR_TMR2_LENGTH                                  0x8
#define _T2TMR_TMR2_MASK                                    0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TMR2                   :8;
    };
} TMR2bits_t;
extern volatile TMR2bits_t TMR2bits __at(0x3FAA);
// bitfield macros
#define _TMR2_TMR2_POSN                                     0x0
#define _TMR2_TMR2_POSITION                                 0x0
#define _TMR2_TMR2_SIZE                                     0x8
#define _TMR2_TMR2_LENGTH                                   0x8
#define _TMR2_TMR2_MASK                                     0xFF

// Register: T2PR
#define T2PR T2PR
extern volatile unsigned char           T2PR                __at(0x3FAB);
#ifndef _LIB_BUILD
asm("T2PR equ 03FABh");
#endif
// aliases
extern volatile unsigned char           _PR2                 __at(0x3FAB);  // Note: Changed by MikroE
#ifndef _LIB_BUILD
asm("_PR2 equ 03FABh");  // Note: Changed by MikroE
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned _PR2                    :8;  // Note: Changed by MikroE
    };
} T2PRbits_t;
extern volatile T2PRbits_t T2PRbits __at(0x3FAB);
// bitfield macros
#define _T2PR_PR2_POSN                                      0x0
#define _T2PR_PR2_POSITION                                  0x0
#define _T2PR_PR2_SIZE                                      0x8
#define _T2PR_PR2_LENGTH                                    0x8
#define _T2PR_PR2_MASK                                      0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned _PR2                    :8;  // Note: Changed by MikroE
    };
} PR2bits_t;
