MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K42/mcu.h
// Register: IVTBASEH
#define IVTBASEH IVTBASEH
extern volatile unsigned char           IVTBASEH            __at(0x3FD6);
#ifndef _LIB_BUILD
asm("IVTBASEH equ 03FD6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BASE8                  :1;
        unsigned BASE9                  :1;
        unsigned BASE10                 :1;
        unsigned BASE11                 :1;
        unsigned BASE12                 :1;
        unsigned BASE13                 :1;
        unsigned BASE14                 :1;
        unsigned BASE15                 :1;
    };
} IVTBASEHbits_t;
extern volatile IVTBASEHbits_t IVTBASEHbits __at(0x3FD6);
// bitfield macros
#define _IVTBASEH_BASE8_POSN                                0x0
#define _IVTBASEH_BASE8_POSITION                            0x0
#define _IVTBASEH_BASE8_SIZE                                0x1
#define _IVTBASEH_BASE8_LENGTH                              0x1
#define _IVTBASEH_BASE8_MASK                                0x1
#define _IVTBASEH_BASE9_POSN                                0x1
#define _IVTBASEH_BASE9_POSITION                            0x1
#define _IVTBASEH_BASE9_SIZE                                0x1
#define _IVTBASEH_BASE9_LENGTH                              0x1
#define _IVTBASEH_BASE9_MASK                                0x2
#define _IVTBASEH_BASE10_POSN                               0x2
#define _IVTBASEH_BASE10_POSITION                           0x2
#define _IVTBASEH_BASE10_SIZE                               0x1
#define _IVTBASEH_BASE10_LENGTH                             0x1
#define _IVTBASEH_BASE10_MASK                               0x4
#define _IVTBASEH_BASE11_POSN                               0x3
#define _IVTBASEH_BASE11_POSITION                           0x3
#define _IVTBASEH_BASE11_SIZE                               0x1
#define _IVTBASEH_BASE11_LENGTH                             0x1
#define _IVTBASEH_BASE11_MASK                               0x8
#define _IVTBASEH_BASE12_POSN                               0x4
#define _IVTBASEH_BASE12_POSITION                           0x4
#define _IVTBASEH_BASE12_SIZE                               0x1
#define _IVTBASEH_BASE12_LENGTH                             0x1
#define _IVTBASEH_BASE12_MASK                               0x10
#define _IVTBASEH_BASE13_POSN                               0x5
#define _IVTBASEH_BASE13_POSITION                           0x5
#define _IVTBASEH_BASE13_SIZE                               0x1
#define _IVTBASEH_BASE13_LENGTH                             0x1
#define _IVTBASEH_BASE13_MASK                               0x20
#define _IVTBASEH_BASE14_POSN                               0x6
#define _IVTBASEH_BASE14_POSITION                           0x6
#define _IVTBASEH_BASE14_SIZE                               0x1
#define _IVTBASEH_BASE14_LENGTH                             0x1
#define _IVTBASEH_BASE14_MASK                               0x40
#define _IVTBASEH_BASE15_POSN                               0x7
#define _IVTBASEH_BASE15_POSITION                           0x7
#define _IVTBASEH_BASE15_SIZE                               0x1
#define _IVTBASEH_BASE15_LENGTH                             0x1
#define _IVTBASEH_BASE15_MASK                               0x80

// Register: IVTBASEU
#define IVTBASEU IVTBASEU
extern volatile unsigned char           IVTBASEU            __at(0x3FD7);
#ifndef _LIB_BUILD
asm("IVTBASEU equ 03FD7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BASE16                 :1;
        unsigned BASE17                 :1;
        unsigned BASE18                 :1;
        unsigned BASE19                 :1;
        unsigned BASE20                 :1;
    };
} IVTBASEUbits_t;
extern volatile IVTBASEUbits_t IVTBASEUbits __at(0x3FD7);
// bitfield macros
#define _IVTBASEU_BASE16_POSN                               0x0
#define _IVTBASEU_BASE16_POSITION                           0x0
#define _IVTBASEU_BASE16_SIZE                               0x1
#define _IVTBASEU_BASE16_LENGTH                             0x1
#define _IVTBASEU_BASE16_MASK                               0x1
#define _IVTBASEU_BASE17_POSN                               0x1
#define _IVTBASEU_BASE17_POSITION                           0x1
#define _IVTBASEU_BASE17_SIZE                               0x1
#define _IVTBASEU_BASE17_LENGTH                             0x1
#define _IVTBASEU_BASE17_MASK                               0x2
#define _IVTBASEU_BASE18_POSN                               0x2
#define _IVTBASEU_BASE18_POSITION                           0x2
#define _IVTBASEU_BASE18_SIZE                               0x1
#define _IVTBASEU_BASE18_LENGTH                             0x1
#define _IVTBASEU_BASE18_MASK                               0x4
#define _IVTBASEU_BASE19_POSN                               0x3
#define _IVTBASEU_BASE19_POSITION                           0x3
#define _IVTBASEU_BASE19_SIZE                               0x1
#define _IVTBASEU_BASE19_LENGTH                             0x1
#define _IVTBASEU_BASE19_MASK                               0x8
#define _IVTBASEU_BASE20_POSN                               0x4
#define _IVTBASEU_BASE20_POSITION                           0x4
#define _IVTBASEU_BASE20_SIZE                               0x1
#define _IVTBASEU_BASE20_LENGTH                             0x1
#define _IVTBASEU_BASE20_MASK                               0x10

// Register: STATUS
#define STATUS STATUS
extern volatile unsigned char           STATUS              __at(0x3FD8);
#ifndef _LIB_BUILD
asm("STATUS equ 03FD8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned NOT_PD                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_TO                 :1;
    };
    struct {
        unsigned C                      :1;
        unsigned DC                     :1;
        unsigned Z                      :1;
        unsigned OV                     :1;
        unsigned N                      :1;
        unsigned nPD                    :1;
        unsigned nTO                    :1;
    };
    struct {
        unsigned                        :5;
        unsigned PD                     :1;
        unsigned TO                     :1;
    };
    struct {
        unsigned CARRY                  :1;
        unsigned                        :1;
        unsigned ZERO                   :1;
        unsigned OVERFLOW               :1;
        unsigned NEGATIVE               :1;
    };
} STATUSbits_t;
extern volatile STATUSbits_t STATUSbits __at(0x3FD8);
// bitfield macros
#define _STATUS_NOT_PD_POSN                                 0x5
#define _STATUS_NOT_PD_POSITION                             0x5
#define _STATUS_NOT_PD_SIZE                                 0x1
#define _STATUS_NOT_PD_LENGTH                               0x1
#define _STATUS_NOT_PD_MASK                                 0x20
#define _STATUS_NOT_TO_POSN                                 0x6
#define _STATUS_NOT_TO_POSITION                             0x6
#define _STATUS_NOT_TO_SIZE                                 0x1
#define _STATUS_NOT_TO_LENGTH                               0x1
#define _STATUS_NOT_TO_MASK                                 0x40
#define _STATUS_C_POSN                                      0x0
#define _STATUS_C_POSITION                                  0x0
#define _STATUS_C_SIZE                                      0x1
#define _STATUS_C_LENGTH                                    0x1
#define _STATUS_C_MASK                                      0x1
#define _STATUS_DC_POSN                                     0x1
#define _STATUS_DC_POSITION                                 0x1
#define _STATUS_DC_SIZE                                     0x1
#define _STATUS_DC_LENGTH                                   0x1
#define _STATUS_DC_MASK                                     0x2
#define _STATUS_Z_POSN                                      0x2
#define _STATUS_Z_POSITION                                  0x2
#define _STATUS_Z_SIZE                                      0x1
#define _STATUS_Z_LENGTH                                    0x1
#define _STATUS_Z_MASK                                      0x4
#define _STATUS_OV_POSN                                     0x3
#define _STATUS_OV_POSITION                                 0x3
#define _STATUS_OV_SIZE                                     0x1
#define _STATUS_OV_LENGTH                                   0x1
#define _STATUS_OV_MASK                                     0x8
#define _STATUS_N_POSN                                      0x4
#define _STATUS_N_POSITION                                  0x4
#define _STATUS_N_SIZE                                      0x1
#define _STATUS_N_LENGTH                                    0x1
#define _STATUS_N_MASK                                      0x10
#define _STATUS_nPD_POSN                                    0x5
#define _STATUS_nPD_POSITION                                0x5
#define _STATUS_nPD_SIZE                                    0x1
#define _STATUS_nPD_LENGTH                                  0x1
#define _STATUS_nPD_MASK                                    0x20
#define _STATUS_nTO_POSN                                    0x6
#define _STATUS_nTO_POSITION                                0x6
#define _STATUS_nTO_SIZE                                    0x1
#define _STATUS_nTO_LENGTH                                  0x1
#define _STATUS_nTO_MASK                                    0x40
#define _STATUS_PD_POSN                                     0x5
#define _STATUS_PD_POSITION                                 0x5
#define _STATUS_PD_SIZE                                     0x1
#define _STATUS_PD_LENGTH                                   0x1
#define _STATUS_PD_MASK                                     0x20
#define _STATUS_TO_POSN                                     0x6
#define _STATUS_TO_POSITION                                 0x6
#define _STATUS_TO_SIZE                                     0x1
#define _STATUS_TO_LENGTH                                   0x1
#define _STATUS_TO_MASK                                     0x40
#define _STATUS_CARRY_POSN                                  0x0
#define _STATUS_CARRY_POSITION                              0x0
#define _STATUS_CARRY_SIZE                                  0x1
#define _STATUS_CARRY_LENGTH                                0x1
#define _STATUS_CARRY_MASK                                  0x1
#define _STATUS_ZERO_POSN                                   0x2
#define _STATUS_ZERO_POSITION                               0x2
#define _STATUS_ZERO_SIZE                                   0x1
#define _STATUS_ZERO_LENGTH                                 0x1
#define _STATUS_ZERO_MASK                                   0x4
#define _STATUS_OVERFLOW_POSN                               0x3
#define _STATUS_OVERFLOW_POSITION                           0x3
#define _STATUS_OVERFLOW_SIZE                               0x1
#define _STATUS_OVERFLOW_LENGTH                             0x1
#define _STATUS_OVERFLOW_MASK                               0x8
#define _STATUS_NEGATIVE_POSN                               0x4
#define _STATUS_NEGATIVE_POSITION                           0x4
#define _STATUS_NEGATIVE_SIZE                               0x1
#define _STATUS_NEGATIVE_LENGTH                             0x1
#define _STATUS_NEGATIVE_MASK                               0x10

// Register: FSR2
#define FSR2 FSR2
extern volatile unsigned short          FSR2                __at(0x3FD9);
#ifndef _LIB_BUILD
asm("FSR2 equ 03FD9h");
#endif

// Register: FSR2L
#define FSR2L FSR2L
extern volatile unsigned char           FSR2L               __at(0x3FD9);
#ifndef _LIB_BUILD
asm("FSR2L equ 03FD9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2L                  :8;
    };
} FSR2Lbits_t;
extern volatile FSR2Lbits_t FSR2Lbits __at(0x3FD9);
// bitfield macros
#define _FSR2L_FSR2L_POSN                                   0x0
#define _FSR2L_FSR2L_POSITION                               0x0
#define _FSR2L_FSR2L_SIZE                                   0x8
#define _FSR2L_FSR2L_LENGTH                                 0x8
#define _FSR2L_FSR2L_MASK                                   0xFF

// Register: FSR2H
#define FSR2H FSR2H
extern volatile unsigned char           FSR2H               __at(0x3FDA);
#ifndef _LIB_BUILD
asm("FSR2H equ 03FDAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2H                  :6;
    };
} FSR2Hbits_t;
